## Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [5]:
import pandas as pd
import random

a =(4,8,15,16,23,42)
pd.Series(a)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

## Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [9]:
b = [1,2,3,4,5,6,7,8,9,0,1]
var = pd.Series(b)
print(var)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9     0
10    1
dtype: int64

## Q3. Create a Pandas DataFrame that contains the following data:

In [9]:
x = {"Name":["Alice","Bob","Claire"],
     "Age":[25,30,27],
     "Gender":["female","Male","Female"]}

z =pd.DataFrame(x)
print(z)

     Name  Age  Gender
0   Alice   25  female
1     Bob   30    Male
2  Claire   27  Female

## Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

DataFrame is a 2-dimensional labeled data structure with columns of potentially different types. You can think of it like a spreadsheet or SQL table, or a dict of Series objects. It is generally the most commonly used pandas object.


1)Series are 1-D, whereas Dataframe are 2-D. 2)Series consists of homogeneous data, whereas dataframe consists of heterogeneous data. 3)series are value mutable whereas dataframe are not.

## Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

Head and Tail. To see the data frame we can use df.


Shape, Size and Info. Two most basic functions after reading data is to know the number of rows and columns, and to know the datatype of variables.


isna.


Describe.

In [10]:
print(z)

     Name  Age  Gender
0   Alice   25  female
1     Bob   30    Male
2  Claire   27  Female

In [14]:
z.head()

     Name  Age  Gender
0   Alice   25  female
1     Bob   30    Male
2  Claire   27  Female

In [13]:
z.isna()

    Name    Age  Gender
0  False  False   False
1  False  False   False
2  False  False   False

In [15]:
z.count()

Name      3
Age       3
Gender    3
dtype: int64

## Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

All Pandas data structures are value mutable (can be changed) and except Series all are size mutable.

## Q7. Create a DataFrame using multiple Series. Explain with an example.

In [17]:
courses = pd.Series(["Spark","PySpark","Hadoop"], name='Courses')
fees = pd.Series([22000,25000,23000], name='Fees')
discount  = pd.Series([1000,2300,1000],name='Discount')

df=pd.concat([courses,fees,discount],axis=1)
pd.DataFrame(df)

   Courses   Fees  Discount
0    Spark  22000      1000
1  PySpark  25000      2300
2   Hadoop  23000      1000